---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.WallsOverlap
source: html/e6c930d3-51a7-4c77-b847-74250154821a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.WallsOverlap Property

Highlighted walls overlap. One of them may be ignored when Revit finds room boundaries. Use Cut Geometry to embed one wall within the other.

## Syntax (C#)
```csharp
public static FailureDefinitionId WallsOverlap { get; }
```